In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

In [2]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]

In [3]:
%%sql
select count(*) as num_album,  ROUND(count(*) * 100.0 /
                                         (select count(*)
  
                                          from album),2)  as Percentage
from album

 * sqlite:///chinook.db
Done.

[(347, 100.0)]

In [53]:
%%sql
SELECT genre.name AS genre, COUNT(track.track_id) AS num_of_track,

ROUND(count(track.track_id) * 100.0 /
            (select count(*) from track),2)  as Percentage
  FROM  genre
  JOIN  track
   ON  genre.genre_id = track.genre_id
  JOIN album
   ON track.album_id =album.album_id
 GROUP BY genre.name
ORDER by num_of_track DESC
 LIMIT 25

 * sqlite:///chinook.db
Done.

[('Rock', 1297, 37.03),
 ('Latin', 579, 16.53),
 ('Metal', 374, 10.68),
 ('Alternative & Punk', 332, 9.48),
 ('Jazz', 130, 3.71),
 ('TV Shows', 93, 2.65),
 ('Blues', 81, 2.31),
 ('Classical', 74, 2.11),
 ('Drama', 64, 1.83),
 ('R&B/Soul', 61, 1.74),
 ('Reggae', 58, 1.66),
 ('Pop', 48, 1.37),
 ('Soundtrack', 43, 1.23),
 ('Alternative', 40, 1.14),
 ('Hip Hop/Rap', 35, 1.0),
 ('Electronica/Dance', 30, 0.86),
 ('World', 28, 0.8),
 ('Heavy Metal', 28, 0.8),
 ('Sci Fi & Fantasy', 26, 0.74),
 ('Easy Listening', 24, 0.69),
 ('Comedy', 17, 0.49),
 ('Bossa Nova', 15, 0.43),
 ('Science Fiction', 13, 0.37),
 ('Rock And Roll', 12, 0.34),
 ('Opera', 1, 0.03)]

In [84]:
%%sql

SELECT genre.name AS genre, COUNT(invoice_line.track_id) AS num_of_track, 

/*ROUND(count() * 100.0 /
            (select count(*) from invoice_line),2)  as Percentage*/


ROUND(SUM(invoice_line.quantity * invoice_line.unit_price *100.0)/
             (SELECT SUM(total)
                FROM invoice WHERE billing_country is 'United Kingdom'),2) AS sales_prop

  FROM  genre
  JOIN  track
   ON  genre.genre_id = track.genre_id
  JOIN album
   ON track.album_id =album.album_id
JOIN invoice_line
ON track.track_id = invoice_line.track_id
 JOIN invoice
ON invoice_line.invoice_id = invoice.invoice_id 
WHERE invoice.billing_country in  ( 'United Kingdom')
GROUP BY genre.name
ORDER by num_of_track DESC
 LIMIT 20

 * sqlite:///chinook.db
Done.

[('Rock', 166, 66.94),
 ('Metal', 31, 12.5),
 ('Alternative & Punk', 24, 9.68),
 ('Latin', 7, 2.82),
 ('Classical', 6, 2.42),
 ('Alternative', 4, 1.61),
 ('Jazz', 3, 1.21),
 ('Reggae', 2, 0.81),
 ('R&B/Soul', 2, 0.81),
 ('Pop', 1, 0.4),
 ('Heavy Metal', 1, 0.4),
 ('Electronica/Dance', 1, 0.4)]

In [78]:
%%sql

SELECT 
   COUNT(i_l.track_id) AS num_of_tracks, track.name as track, album.title as Album, genre.name as Genre, 
    i_l.unit_price
    FROM  genre
    JOIN  track
   ON  genre.genre_id = track.genre_id     
join invoice_line as i_l
  on i_l.track_id = track.track_id 
 JOIN album
 ON track.album_id = album.album_id
 JOIN artist
 ON album.artist_id = artist.artist_id
 join invoice
 ON i_l.invoice_id = invoice.invoice_id
 WHERE invoice.billing_country in  ( 'United Kingdom') 
 group by i_l.track_id, invoice.billing_country
 ORDER BY COUNT(i_l.track_id) DESC
 LIMIT 5

 * sqlite:///chinook.db
Done.

[(3, 'Das Lied Von Der Erde, Von Der Jugend', 'Great Recordings of the Century - Mahler: Das Lied von der Erde', 'Classical', 0.99),
 (2, 'For Those About To Rock (We Salute You)', 'For Those About To Rock We Salute You', 'Rock', 0.99),
 (2, 'Put The Finger On You', 'For Those About To Rock We Salute You', 'Rock', 0.99),
 (2, "Let's Get It Up", 'For Those About To Rock We Salute You', 'Rock', 0.99),
 (2, 'Inject The Venom', 'For Those About To Rock We Salute You', 'Rock', 0.99)]

In [85]:
%%sql

SELECT 
   genre.name AS genre, album.title as album, count(album.album_id) as num_of_album , artist.name as artist,
    
    ROUND(count(*) * 100.0 /
            (select count(*) from album),2 )  as Percentage
    
    FROM  genre
    JOIN  track
   ON  genre.genre_id = track.genre_id     
 join invoice_line as i_l
on i_l.track_id = track.track_id
 join invoice
 ON i_l.invoice_id = invoice.invoice_id
 JOIN album
 ON track.album_id = album.album_id
 JOIN artist
 ON album.artist_id = artist.artist_id
     WHERE invoice.billing_country in  ( 'United Kingdom')
 group by album.album_id
 ORDER BY num_of_album DESC
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Rock', 'For Those About To Rock We Salute You', 20, 'AC/DC', 5.76),
 ('Metal', 'Ace Of Spades', 17, 'Motörhead', 4.9),
 ('Rock', 'The Police Greatest Hits', 16, 'The Police', 4.61),
 ('Rock', 'By The Way', 16, 'Red Hot Chili Peppers', 4.61),
 ('Rock', 'Jagged Little Pill', 14, 'Alanis Morissette', 4.03)]

Employee sales performance

In [113]:
%%sql
SELECT  invoice.billing_country, employee.last_name || ' ' || employee.first_name AS Employee, 
SUBSTRING(employee.hire_date, 1 , 10) AS Hire_date, employee.country,
ROUND(SUM(invoice_line.quantity * invoice_line.unit_price),2)  AS total_sales,
SUM(invoice_line.quantity) AS quantity_sold,
ROUND(SUM(invoice_line.quantity * invoice_line.unit_price *100.0)/
             (SELECT SUM(total)
                FROM invoice   WHERE invoice.billing_country in ( 'United Kingdom')  ),2) AS sales_prop
 FROM employee
join customer
ON employee.employee_id = customer.support_rep_id
JOIN invoice
ON invoice.customer_id = customer.customer_id
join invoice_line
ON invoice.invoice_id = invoice_line.invoice_id
WHERE invoice.billing_country in ( 'United Kingdom')
Group by employee.employee_id
ORDER by ROUND(SUM(total),2) DESC
LIMIT 10

 * sqlite:///chinook.db
Done.

[('United Kingdom', 'Peacock Jane', '2017-04-01', 'Canada', 166.32, 168, 67.74),
 ('United Kingdom', 'Johnson Steve', '2017-10-17', 'Canada', 79.2, 80, 32.26)]

In [20]:
%%sql
select SUM(total) as total
from invoice
WHERE invoice.billing_country in ( 'United Kingdom')

 * sqlite:///chinook.db
Done.

[(245.52,)]

In [88]:
%%sql
SELECT billing_country, 
 round(sum(invoice.total),2) as total,
       ROUND(COUNT(*)*100.0/
             (SELECT COUNT(*) 
                FROM invoice), 2)  AS sales_prop
  
FROM invoice
GROUP BY billing_country
ORDER BY sales_prop DESC
 LIMIT 15

 * sqlite:///chinook.db
Done.

[('USA', 1040.49, 21.34),
 ('Canada', 535.59, 12.38),
 ('Brazil', 427.68, 9.93),
 ('France', 389.07, 8.14),
 ('Germany', 334.62, 6.68),
 ('Czech Republic', 273.24, 4.89),
 ('Portugal', 185.13, 4.72),
 ('United Kingdom', 245.52, 4.56),
 ('India', 183.15, 3.42),
 ('Ireland', 114.84, 2.12),
 ('Chile', 97.02, 2.12),
 ('Spain', 98.01, 1.79),
 ('Finland', 79.2, 1.79),
 ('Sweden', 75.24, 1.63),
 ('Poland', 76.23, 1.63)]